---
kind: property
id: P:Autodesk.Revit.DB.MEPSystemType.LineColor
source: html/83e01a4d-d51e-42bf-fe18-7c5856fe5c6e.htm
---
# Autodesk.Revit.DB.MEPSystemType.LineColor Property

Indicates the color that should override the line color for all components in the system.

## Syntax (C#)
```csharp
public Color LineColor { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null